base/Catalogs/бит_ВидыПроизвольныхФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыПроизвольныхФорм</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчикаПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтекПеременных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиРеквизитов</Name>
					<Comment>Настройки реквизитов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Comment>Имя таблицы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Comment>Синоним</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Comment>Доступные типы значений в строковом представлении</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>Служит для связи с данными дерева</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоля</Name>
							<Comment>Вид поля</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПолейПроформы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Comment>Проверка заполнения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаВыбора</Name>
							<Comment>Кнопка выбора</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОчистки</Name>
							<Comment>Кнопка очистки</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОткрытия</Name>
							<Comment>Кнопка открытия</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Comment>Ширина</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаРегулирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДаНетАвто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеНастроек</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУстановлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьИтог</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиДвижений</Name>
					<Comment>Движения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Comment>Активность</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонДвижений</Name>
							<Comment>Шаблон движений</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ВидыПроизвольныхФорм/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьДублиИмен(Отказ);
	
	Если НЕ Отказ И НЕ ЭтоГруппа Тогда
		бит_МеханизмХозяйственныхОперацийСервер.ИнтерпретироватьШаблоныПроформы(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
	
		Для каждого СтрокаТаблицы Из НастройкиДвижений Цикл
		
			Если СтрокаТаблицы.ШаблонДвижений.ПометкаУдаления <> ПометкаУдаления Тогда
			
				ШаблонОбъект = СтрокаТаблицы.ШаблонДвижений.ПолучитьОбъект();
				
				Попытка
					ШаблонОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
				Исключение
					ТекстСообщения = НСтр("ru='Не удалось пометить на удаление шаблон движений ""%1"" по причине: %2.';
										  |en='Failed to mark for deletion the movement template ''%1"" because:%2.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.ШаблонДвижений, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецПопытки;
			
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЕсли; 
	
КонецПроцедуры // ПриЗаписи()

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда
		НастройкиДвижений.Очистить();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет проверку на дубли имен реквизитов и табличных частей. 
// 
// Параметры:
//  Отказ - Булево.
// 
Процедура ПроверитьДублиИмен(Отказ)
	
	// Проверка уникальности имени проформы.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Имя"   , Имя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыПроизвольныхФорм.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.бит_ВидыПроизвольныхФорм КАК ВидыПроизвольныхФорм
	               |ГДЕ
	               |	ВидыПроизвольныхФорм.Имя = &Имя
	               |	И ВидыПроизвольныхФорм.Ссылка <> &Ссылка";
				   
				   
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ТекстСообщения = НСтр("ru='Имя вида проформы ""%1"" не уникально.';
							  |en='Name the type of pro forma ""%1"" is not unique.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Имя);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		Отказ = Истина;
	
	КонецЕсли; 
	
	// Проверка на дубли имен
	// в пределах одной коллекции - Реквизиты, ТабличныеЧасти, <ТабличнаяЧасть> - дублей имен быть не должно.
	ТабТест = НастройкиРеквизитов.Выгрузить(,"ИмяТаблицы,Имя");
	ТабТест.Колонки.Добавить("Количество");
	ТабТест.ЗаполнитьЗначения(1,"Количество");
	ТабТест.Свернуть("ИмяТаблицы, Имя", "Количество");
	ТабТест.Сортировать("ИмяТаблицы");
	
	Для каждого СтрокаТаблицы Из ТабТест Цикл
		
		Если СтрокаТаблицы.Количество > 1 Тогда
			
			Отказ = Истина;
			Если СтрокаТаблицы.ИмяТаблицы = "Реквизиты" Тогда
				
				ТекстСообщения = НСтр("ru='Обнаружено дублирующееся имя реквизитов ""%1"".';
									  |en='Details found duplicates the name ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.Имя);
				
			ИначеЕсли СтрокаТаблицы.ИмяТаблицы = "ТабличныеЧасти" Тогда
				
				ТекстСообщения = НСтр("ru='Обнаружено дублирующееся имя табличных частей ""%1"".';
									  |en='It found a duplicate table name parts ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.Имя);
				
			Иначе	
				
				ТекстСообщения = НСтр("ru='Обнаружено дублирующееся имя реквизита ""%1"" в табличной части ""%2"".';
									  |en='It found a duplicate name props ""%1"" in the table of the ""%2"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.Имя, СтрокаТаблицы.ИмяТаблицы);				
				
			КонецЕсли; // СтрокаТаблицы.ИмяТаблицы;
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; // СтрокаТаблицы.Количество
		
	КонецЦикла; // ТабТест
	
	// Проверка на дубли имен реквизитов шапки и табличных частей.
	СтрОтбор = Новый Структура("ИмяТаблицы","ТабличныеЧасти");
	МассивТЧ = ТабТест.НайтиСтроки(СтрОтбор);
	
	СтрОтбор = Новый Структура("ИмяТаблицы", "Реквизиты");
	МассивСтрок = ТабТест.НайтиСтроки(СтрОтбор);
	
	МассивРеквизитов = Новый Массив;
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл	
		МассивРеквизитов.Добавить(СтрокаТаблицы.Имя);	
	КонецЦикла; 
	
	Для каждого СтрокаТЧ Из МассивТЧ Цикл
		
		Если МассивРеквизитов.Найти(СтрокаТЧ.Имя) <> Неопределено Тогда
			
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='Обнаружено дублирующееся имя реквизита шапки и табличной части ""%1"".';
								  |en='It found a duplicate name props hats and tables of ""%1"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.Имя);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; 
		
	КонецЦикла; // МассивТЧ
	
КонецПроцедуры // ПроверитьДублиИмен()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
